Revit 2027 API
Part.ResetPartShape Method
 Resets all face offsets applied to part faces.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetPartShape()
Public Sub ResetPartShape
public:
void ResetPartShape()
member ResetPartShape : unit -> unit
See Also
Reference
Part Class
Autodesk.Revit.DB Namespace